; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v6 ?v7)
             (pred_10 ?v3 ?v9)
             (pred_5 ?v6 ?v9)
             (pred_2 ?v11 ?v6 )
	     (pred_8 ?v6)
             (pred_4 ?v10)
             (pred_11 ?v3)
             (pred_1 ?v9)
             (pred_9 ?v6)
             (pred_7 ?v3)
             (pred_6 ?v6)
             (pred_3 ))



(:action op_3
:parameters (?v4 ?v13 ?v2 ?v1)
:precondition (and (pred_4 ?v4) (pred_4 ?v13) (pred_11 ?v2) (pred_1 ?v1)
          (pred_12 ?v4 ?v13) (pred_10 ?v2 ?v1)
                   (pred_5 ?v13 ?v1) (pred_8 ?v4) 
                   (pred_9 ?v13) (pred_7 ?v2))
:effect (and  (pred_6 ?v13) (not (pred_9 ?v13))))


(:action op_1
:parameters (?v4 ?v8)
:precondition (and (pred_4 ?v4) (pred_4 ?v8)
               (pred_8 ?v4) (pred_12 ?v4 ?v8) (pred_6 ?v8))
:effect (and (pred_8 ?v8) (not (pred_8 ?v4))))

(:action op_4
:parameters (?v4 ?v2)
:precondition (and (pred_4 ?v4) (pred_11 ?v2) 
                  (pred_8 ?v4) (pred_2 ?v2 ?v4) (pred_3 ))
:effect (and (pred_7 ?v2)
   (not (pred_2 ?v2 ?v4)) (not (pred_3 ))))


(:action op_2
:parameters (?v4 ?v12 ?v5)
:precondition (and (pred_4 ?v4) (pred_11 ?v12) (pred_11 ?v5)
                  (pred_8 ?v4) (pred_7 ?v5) (pred_2 ?v12 ?v4))
:effect (and (pred_7 ?v12) (pred_2 ?v5 ?v4)
        (not (pred_7 ?v5)) (not (pred_2 ?v12 ?v4))))

(:action op_5
:parameters (?v4 ?v2)
:precondition (and (pred_4 ?v4) (pred_11 ?v2) 
                  (pred_8 ?v4) (pred_7 ?v2))
:effect (and (pred_3 ) (pred_2 ?v2 ?v4) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_13 obj_15 obj_18 obj_01 obj_19 obj_14 obj_17 obj_20 obj_12 obj_11 obj_05 obj_21 obj_09 obj_03 obj_04
    obj_07 obj_16
    obj_08 obj_10 obj_06
    )

    (:init
       (pred_3)

       (pred_4 obj_02)
       (pred_4 obj_13)
       (pred_4 obj_15)
       (pred_4 obj_18)
       (pred_4 obj_01)
       (pred_4 obj_19)
       (pred_4 obj_14)
       (pred_4 obj_17)
       (pred_4 obj_20)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_4 obj_05)
       (pred_4 obj_21)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_1 obj_07)
       (pred_1 obj_16)
       (pred_11 obj_08)
       (pred_11 obj_10)
       (pred_11 obj_06)

       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_15)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_18)
       (pred_12 obj_15 obj_13)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_15)
       (pred_12 obj_01 obj_20)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_19 obj_12)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_17 obj_05)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_01)
       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_11)
       (pred_12 obj_12 obj_19)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_11 obj_03)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_11 obj_12)
       (pred_12 obj_05 obj_04)
       (pred_12 obj_05 obj_17)
       (pred_12 obj_05 obj_11)
       (pred_12 obj_21 obj_09)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_09 obj_21)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_11)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_04 obj_05)
       (pred_12 obj_04 obj_03)
       (pred_9 obj_19)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_5  obj_19 obj_07)
       (pred_5  obj_17 obj_16)
       (pred_5  obj_03 obj_07)
       (pred_6 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_15)
       (pred_6 obj_18)
       (pred_6 obj_01)
       (pred_6 obj_14)
       (pred_6 obj_20)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_6 obj_05)
       (pred_6 obj_21)
       (pred_6 obj_09)
       (pred_6 obj_04)

       (pred_10  obj_08 obj_07)
       (pred_10  obj_10 obj_16)
       (pred_10  obj_06 obj_07)
       (pred_2 obj_08 obj_11)
       (pred_2 obj_10 obj_14)
       (pred_2 obj_06 obj_11)
       (pred_8 obj_01)
    )

    (:goal (and
       (pred_2 obj_08 obj_01)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_06 obj_19)
    ))
(:constraints
  (always (not (pred_8 obj_12)))
)
)

; plan
1. (op_1 obj_01 obj_02)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_02)
   goals met: 0 of 3
2. (op_1 obj_02 obj_13)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_13)
   goals met: 0 of 3
3. (op_1 obj_13 obj_15)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_15)
   goals met: 0 of 3
4. (op_1 obj_15 obj_14)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_14)
   goals met: 0 of 3
5. (op_4 obj_14 obj_10)
   deleted: (pred_2 obj_10 obj_14) (pred_3)
   added: (pred_7 obj_10)
   goals met: 0 of 3
6. (op_1 obj_14 obj_15)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_15)
   goals met: 0 of 3
7. (op_1 obj_15 obj_13)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_13)
   goals met: 0 of 3
8. (op_1 obj_13 obj_02)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_02)
   goals met: 0 of 3
9. (op_5 obj_02 obj_10)
   deleted: (pred_7 obj_10)
   added: (pred_3) (pred_2 obj_10 obj_02)
   goals met: 1 of 3
10. (op_1 obj_02 obj_13)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_13)
   goals met: 1 of 3
11. (op_1 obj_13 obj_15)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_15)
   goals met: 1 of 3
12. (op_1 obj_15 obj_14)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_14)
   goals met: 1 of 3
13. (op_1 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 1 of 3
14. (op_4 obj_11 obj_06)
   deleted: (pred_2 obj_06 obj_11) (pred_3)
   added: (pred_7 obj_06)
   goals met: 1 of 3
15. (op_1 obj_11 obj_14)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_14)
   goals met: 1 of 3
16. (op_3 obj_14 obj_19 obj_06 obj_07)
   deleted: (pred_9 obj_19)
   added: (pred_6 obj_19)
   goals met: 1 of 3
17. (op_1 obj_14 obj_19)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_19)
   goals met: 1 of 3
18. (op_5 obj_19 obj_06)
   deleted: (pred_7 obj_06)
   added: (pred_3) (pred_2 obj_06 obj_19)
   goals met: 2 of 3
19. (op_1 obj_19 obj_14)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_14)
   goals met: 2 of 3
20. (op_1 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 2 of 3
21. (op_4 obj_11 obj_08)
   deleted: (pred_2 obj_08 obj_11) (pred_3)
   added: (pred_7 obj_08)
   goals met: 2 of 3
22. (op_1 obj_11 obj_14)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_14)
   goals met: 2 of 3
23. (op_1 obj_14 obj_19)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_19)
   goals met: 2 of 3
24. (op_1 obj_19 obj_01)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_01)
   goals met: 2 of 3
25. (op_5 obj_01 obj_08)
   deleted: (pred_7 obj_08)
   added: (pred_3) (pred_2 obj_08 obj_01)
   goals met: 3 of 3
